Repository: moreonion/mpay24_payment
Catalog: translations/*.po
Languages: de

source: The administrators of this site need to set a merchant id before this form becomes usable
de: Die merchant id muss gesetzt werden, bevor die mPay24 Zahlungsmethoden verfügbar werden.

source: @payment_method payment method encountered some error while contacting the mPay24 server. The code is "@code" and the error message "@error". Pid payment : @pid and pmid method used : @pmid
de: Fehler beim Kontaktieren des mpay24-Servers: Zahlungsmethode @payment_method, Fehlercode: "@code", Fehlermeldung "@error". Zahlungs-ID: @pid, Zahlungsmethode-ID: @pmid.

source: @payment_method payment method encountered some HTTP error while trying to contact the mPay24 server. Error code "@code" and the error message "@error". Pid payment : @pid and pmid method used : @pmid
de: HTTP-Fehler beim Kontaktieren des mpay24-Servers: Zahlungsmethode @payment_method, Fehlercode: "@code", Fehlermeldung "@error". Zahlungs-ID: @pid, Zahlungsmethode-ID: @pmid.

source: No redirection url set for redirected payment @pid.
de: Für die Zahlung @pid ist keine Weiterleitung definiert.

source: Please wait while we are proccessing your payment.
de: Der Zahlungsvorgang läuft. Bitte warten.

source: An error occured. Please try again later.
de: Unbekannter Fehler ist aufgetreten. Bitte versuchen Sie es erneut.

source: A Payment API method to transfer money using the payment provider https://mpay24.com
de: Zahlungsmethoden für den mPay24-Zahlungsprovider (https://mpay24.com)

source: mPay24 Credit Card
de: mPay24 Kreditkarte

source: Credit Card
de: Kreditkarte

source: Issuer
de: Herausgeber

source: Credit card number
de: Kreditkartennummer

source: Expiry date
de: gültig bis

source: @name is required
de: Das Feld @name muss ausgefüllt sein.

source: %card is not a valid credit card number.
de: %card ist keine gültige Kreditkartennummer.

source: Credit card number %card doesn't appear to be from issuer %issuer.
de: Die Kreditkartennummer %card scheint nicht zum Herausgeber %issuer zu gehören.

source: The entered expiration date is wrong or the card is expired.
de: Das Gültigkeitsdatum passt nicht zu dieser Kreditkarte oder die Karte is nicht mehr gültig.

source: Please enter a valid credit card number.
de: Bitte geben Sie eine gültige Kreditkartennummer an.

source: Please enter the correct secure code.
de: Bitte geben Sie den passenden Securecode an.

source: Timeout for payment requests
de: Timeout für Zahlungsanfragen.

source: Timeout for the payment request to MPay24 (in Seconds).
de: Timeout für Anfragen an mPay24 (in Sekunden).

source: Available from MPay24 support.
de: beim mPay24-Support erhältlich

source: Use the test API
de: Testschnittstelle verwenden

source: Requires a different MerchantID.
de: benötigt eine andere MerchantID.

source: MPay24 (Payment)
de: mPay24 (Zahlung)

source: A payment method type that uses mpay24.com
de: Zahlungsabwicklung über mPay24 (mpay24.com)
